# -*- encoding: utf-8 -*-
"""
@File: metrics_cal_config.py
@Modify Time: 2025/4/9 10:52       
@Author: Kevin-Chen
@Descriptions: 金融指标计算参数文件
"""
import numpy as np
from collections import defaultdict

import pandas as pd

# 年化收益率计算的天数
return_ann_factor = 365
# 年化波动率计算的天数
risk_ann_factor = 252

# 无风险普通年化收益率
no_risk_ann_return = 0.015
# 无风险普通每日收益率 (使用 自然日or交易日 ? 请自由调整)
daily_return = (1 + no_risk_ann_return) ** (1 / return_ann_factor) - 1
# 无风险对数每日收益率
log_daily_return = np.log(1 + daily_return)
# 无风险对数年化收益率
log_ann_return = np.log(1 + no_risk_ann_return)

# 区间指标支持的区间代码
period_list = [
    '2d',  # 2天
    '3d',  # 3天
    '5d',  # 5天
    '6d',  # 6天
    '7d',  # 7天
    '10d',  # 10天 (2周)
    '15d',  # 15天 (3周)
    '20d',  # 20天 (4周)
    '25d',  # 25天 (一个月)
    '50d',  # 50天 (两个月)
    '75d',  # 75天 (三个月)
    '5m',  # 5个月
    '6m',  # 6个月
    '9m',  # 9个月
    '12m',  # 12个月（1年）
    '2y',  # 2年
    '3y',  # 3年
    '5y',  # 5年
    'mtd',  # 本月至今（Month-to-Date）
    'qtd',  # 本季度至今（Quarter-to-Date）
    'ytd',  # 本年至今（Year-to-Date）
    'max',  # 最大
]

# 区间指标
log_return_metrics_dict = {
    'TotalReturn':
        ['总收益率',  # 指标名称
         '总收益率 = (最终价值 - 初始价值) / 初始价值',  # 指标的简要计算方法说明
         # 支持计算的区间
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'AnnualizedReturn':
        ['年化收益率',
         '年化收益率 = (1 + 总收益率)^(return_ann_factor/天数) - 1',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'AverageDailyReturn':
        ['日均收益率',
         '日均收益率 = 总收益率 / 交易天数',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'AvgPositiveReturn':
        ['平均正收益率',
         '平均正收益率 = 所有正收益的平均值',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'AvgNegativeReturn':
        ['平均负收益率',
         '平均负收益率 = 所有负收益的平均值',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'AvgReturnRatio':
        ['平均盈亏比',
         '平均盈亏比 = 平均正收益率 / 平均负收益率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'TotalPositiveReturn':
        ['总累计盈利',
         '总累计盈利 = 所有正收益的总和',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'TotalNegativeReturn':
        ['总累计亏损',
         '总累计亏损 = 所有负收益的总和',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'TotalReturnRatio':
        ['累计盈亏比',
         '累计盈亏比 = 总累计盈利 / 总累计亏损',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'MedianDailyReturn':
        ['日中位收益率',
         '日中位收益率 = 所有日收益率的中位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'Volatility':
        ['波动率',
         '波动率 = 收益率的标准差',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'AnnualizedVolatility':
        ['年化波动率',
         '年化波动率 = 波动率 * sqrt(risk_ann_factor)',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'MeanAbsoluteDeviation':
        ['平均绝对偏差',
         '平均绝对偏差 = 平均每期收益率距离均值的绝对值, 比标准差更不受极端值影响',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'ReturnRange':
        ['收益率范围, 也称为极差',
         '收益率范围 = 收益率的最大值 - 收益率的最小值',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'RescaledRange':
        ['标准化极差',
         '标准化极差 = (收益率的最大值 - 收益率的最小值) / 波动率',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'MaxGain':
        ['最大单日收益',
         '最大收益 = 收益率的最大值',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'MaxLoss':
        ['最大单日亏损',
         '最大亏损 = 收益率的最小值',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'MaxDrawDown':  # 最大回撤用的是普通回撤率,而非对数回撤率
        ['最大回撤',
         '最大回撤 = (峰值 - 谷值) / 峰值',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'MaxDrawDownDays':  # 最大回撤用的是普通回撤率,而非对数回撤率
        ['最大回撤天数',
         '最大回撤天数 = 回撤开始到谷底的交易日天数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'ReturnDrawDownRatio':  # 最大回撤用的是普通回撤率,而非对数回撤率
        ['收益率回撤比',
         '收益率回撤比 = 总收益率 / 最大回撤',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'DrawDownSlope':  # 最大回撤用的是普通回撤率,而非对数回撤率
        ['回撤斜率',
         '回撤斜率 = 最大回撤幅度 / 回撤所用时间',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'UlcerIndex':  # 最大回撤用的是普通回撤率,而非对数回撤率
        ['溃疡指数 (衡量最大回撤深度和持续时间的指标)',
         '溃疡指数 = 所有 draw down 的均方根（RMS）',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'MartinRatio':
        ['马丁比率 (绩效趋势比率), 衡量趋势的可复制性',
         '马丁比率 = 年化收益率 / 溃疡指数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'SharpeRatio':
        ['夏普比率',
         '夏普比率 = (累计收益率 - 无风险收益) / 投资组合波动率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'AnnualizedSharpeRatio':
        ['年化夏普比率',
         '年化夏普比率 = 夏普比率 * sqrt(年交易天数)',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'ReturnVolatilityRatio':
        ['收益率波动率比',
         '收益率波动率比 = 总收益率 / 波动率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'DownsideVolatility':
        ['下行波动率',
         '下行波动率 = 负收益率的标准差',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'UpsideVolatility':
        ['上行波动率',
         '上行波动率 = 正收益率的标准差',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VolatilitySkew':
        ['波动率偏度',
         '波动率偏度 = (上行波动率 - 下行波动率) / 总波动率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VolatilityRatio':
        ['波动率比, 也叫 上行潜在比率',
         '波动率比 = 上行波动率 / 下行波动率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'SortinoRatio':
        ['索提诺比率',
         '索提诺比率 = (累计收益率 - 无风险收益率) / 下行波动率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'GainConsistency':
        ['收益趋势一致性',
         '收益趋势一致性 = 盈利日的标准差(上行波动率) / 盈利日的平均收益(平均正收益率)',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'LossConsistency':
        ['亏损趋势一致性',
         '亏损趋势一致性 = 亏损日的标准差(下行波动率) / 亏损日的平均亏损(平均负收益率)',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'WinningRatio':
        ['胜率',
         '胜率 = 盈利交易次数(不含0) / 总交易次数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'LosingRatio':
        ['亏损率',
         '亏损率 = 亏损交易次数(不含0) / 总交易次数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'ReturnSkewness':
        ['收益率偏度',
         '收益率偏度 = 收益率分布的偏度',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'ReturnKurtosis':
        ['收益率峰度',
         '收益率峰度 = 收益率分布的峰度',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VaR-99':
        ['99% VaR',
         '99% VaR = 在99%的置信水平下，投资组合可能的最大损失',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VaR-95':
        ['95% VaR',
         '95% VaR = 在95%的置信水平下，投资组合可能的最大损失',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VaR-90':
        ['90% VaR',
         '90% VaR = 在90%的置信水平下，投资组合可能的最大损失',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VaRSharpe-95':
        ['基于 95% VaR 计算夏普比率',
         '基于 95% VaR 计算夏普比率 = (投资组合收益率 - 无风险收益率) / 95% VaR',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VaRModified-99':
        ['99% 修正VaR',
         '99% 修正VaR = 在传统正态 VaR 的基础上，使用 Cornish-Fisher 展开修正尾部概率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VaRModified-95':
        ['95% 修正VaR',
         '95% 修正VaR = 在传统正态 VaR 的基础上，使用 Cornish-Fisher 展开修正尾部概率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VaRModified-90':
        ['90% 修正VaR',
         '90% 修正VaR = 在传统正态 VaR 的基础上，使用 Cornish-Fisher 展开修正尾部概率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VaRModifiedSharpe-95':
        ['基于 95% 修正VaR 计算夏普比率',
         '基于 95% 修正VaR 计算夏普比率 = (投资组合收益率 - 无风险收益率) / 95% 修正VaR',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CVaR-99':
        ['99% CVaR',
         '99% CVaR = 在99%的置信水平下，投资组合可能的平均损失',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CVaR-95':
        ['95% CVaR',
         '95% CVaR = 在95%的置信水平下，投资组合可能的平均损失',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CVaR-90':
        ['90% CVaR',
         '90% CVaR = 在90%的置信水平下，投资组合可能的平均损失',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CVaRModified-99':
        ['99% 修正CVaR',
         '99% 修正CVaR = 在传统正态 CVaR 的基础上，使用 Cornish-Fisher 展开修正尾部概率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CVaRModified-95':
        ['95% 修正CVaR',
         '95% 修正CVaR = 在传统正态 CVaR 的基础上，使用 Cornish-Fisher 展开修正尾部概率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CVaRModified-90':
        ['90% 修正CVaR',
         '90% 修正CVaR = 在传统正态 CVaR 的基础上，使用 Cornish-Fisher 展开修正尾部概率',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CVaRSharpe-95':
        ['基于 95% CVaR 计算夏普比率',
         '基于 95% CVaR 计算夏普比率 = (投资组合收益率 - 无风险收益率) / 95% CVaR',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CVaRModifiedSharpe-95':
        ['基于 95% 修正CVaR 计算夏普比率',
         '基于 95% 修正CVaR 计算夏普比率 = (投资组合收益率 - 无风险收益率) / 95% 修正CVaR',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'Percentile-1':
        ['所有收益率前1%分位数 (一般是极端亏损部分)',
         '所有收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'Percentile-99':
        ['所有收益率前99%分位数 (一般是极端盈利部分)',
         '所有收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'Percentile-5':
        ['所有收益率前5%分位数 (一般是极端亏损部分)',
         '所有收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'Percentile-95':
        ['所有收益率前95%分位数 (一般是极端盈利部分)',
         '所有收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'Percentile-10':
        ['所有收益率前10%分位数 (一般是极端亏损部分)',
         '所有收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'Percentile-90':
        ['所有收益率前90%分位数 (一般是极端盈利部分)',
         '所有收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'PercentileWin-95':
        ['正收益率前5%分位数',
         '只考虑正收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'PercentileLoss-95':
        ['负收益率取绝对值后, 前5%分位数',
         '只考虑负收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'PercentileWin-90':
        ['正收益率前10%分位数',
         '只考虑正收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'PercentileLoss-90':
        ['负收益率取绝对值后, 前10%分位数',
         '只考虑负收益率的分位数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'TailRatio-90':
        ['尾部比率, 极端正收益与极端负收益的比值',
         'TailRatio-90 = PercentileWin-90 / PercentileLoss-90',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'TailRatio-95':
        ['尾部比率, 极端正收益与极端负收益的比值',
         'TailRatio-95 = PercentileWin-95 / PercentileLoss-95',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'NewHighRatio':
        ['净值新高比率',
         '净值新高比率 = 净值创新高的交易日数 / 总交易日数',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CrossProductRatio-1':
        ['交叉乘积比率 (基于单日收益统计)',
         '交叉乘积比率 = (WW * LL) / (WL * LW)',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CrossProductRatio-5':
        ['交叉乘积比率 (基于5日收益统计)',
         '交叉乘积比率 = (WW * LL) / (WL * LW)',
         ['50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'CrossProductRatio-10':
        ['交叉乘积比率 (基于10日收益统计)',
         '交叉乘积比率 = (WW * LL) / (WL * LW)',
         ['75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'HurstExponent':  # 计算资源较大,涉及线性回归,无法矢量化
        ['赫斯特指数',
         '赫斯特指数 = 对净值构造时间序列，进行 R/S 分析',
         ['70d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'OmegaRatio':
        ['欧米茄比率',
         '欧米茄比率 = 更全面的夏普比率扩展版本（考虑全部分布）',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'ReturnDistributionIntegral':
        ['收益分布积分',
         '收益分布积分 = Omega Ratio 的分子部分',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    "ReturnSlope":
        ['收益斜率',
         '收益斜率 = 收益率拟合直线的 slope',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'KRatio':
        ['K比率 (绩效趋势比率), 衡量趋势的可复制性',
         'K比率 = 净值的 log 值拟合直线的 slope / 标准差',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'SortinoSkewness':
        ['索提诺偏度',
         '索提诺偏度 = 类似 Skewness，但只考虑负收益部分的偏度（衡量尾部亏损分布）',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'NetEquitySlope':
        ['净值增长斜率 (代表了净值随时间的平均上升速度)',
         '净值增长斜率 = 净值的 log 值拟合直线的 slope',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'EquitySmoothness':
        ['净值平滑度 (衡量策略净值序列与其线性拟合值之间的拟合程度)',
         '净值平滑度 = 净值的 log 值拟合曲线的 R^2',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VolAvg':
        ['平均成交量',
         '平均成交量 = 过去N天的平均成交量',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'VolSlope':
        ['成交量斜率',
         '成交量斜率 = 过去N天的成交量拟合直线的 slope',
         ['3d', '5d', '10d', '15d', '25d', '50d', '75d', '5m', '6m'],
         ],
    'VolVolatility':
        ['成交量波动率',
         '成交量波动率 = 过去N天的成交量标准差',
         ['5d', '6d', '7d', '10d', '15d', '20d', '25d', '30d', '35d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'MaxHigh':
        ['最高价',
         '最高价 = 过去N天的最高价',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'MinLow':
        ['最低价',
         '最低价 = 过去N天的最低价',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'HLDiff':
        ['High-Low 差值',
         'High-Low 差值 = 过去N天的最高价与最低价之差',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'AvgHigh':
        ['High 平均值',
         'High 平均值 = 过去N天的最高价平均值',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
    'AvgLow':
        ['Low 平均值',
         'Low 平均值 = 过去N天的最低价平均值',
         ['2d', '3d', '5d', '6d', '7d', '10d', '15d', '20d', '25d', '50d', '75d', '5m', '6m', '9m', '12m', '2y'],
         ],
}

# 历史偏离指标
log_return_relative_metrics_dict = {

    ''' 相对历史收益指标 '''
    'ReturnZScore_2m':
        ['当前平均收益相对近2个月收益的 Z 分数',
         '收益率Z分数 = (当前平均收益 - 近2个月平均收益) / 近2个月标准差',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d'],
         ],
    'ReturnZScore_6m':
        ['当前平均收益相对近半年收益的 Z 分数',
         '收益率Z分数 = (当前平均收益 - 近半年平均收益) / 近半年标准差',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d', '50d', '75d'],
         ],
    'ReturnZScore_1y':
        ['当前平均收益相对近1年收益的 Z 分数',
         '收益率Z分数 = (当前平均收益 - 近1年平均收益) / 近1年标准差',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d', '50d', '75d', '5m', '6m'],
         ],
    'ReturnZScore_2y':
        ['当前平均收益相对近2年收益的 Z 分数',
         '收益率Z分数 = (当前平均收益 - 近2年平均收益) / 近2年标准差',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d', '50d', '75d', '5m', '6m', '1y'],
         ],
    'ReturnPercentile_2m':
        ['当前收益率相对近2个月收益的分位数',
         '收益率分位数 = 当前收益率在近2个月的同类收益率中的分位数',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d'],
         ],
    'ReturnPercentile_6m':
        ['当前收益率相对近6个月收益的分位数',
         '收益率分位数 = 当前收益率在近2个月的同类收益率中的分位数',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d', '50d', '75d'],
         ],
    'ReturnPercentile_1y':
        ['当前收益率相对近1年收益的分位数',
         '收益率分位数 = 当前收益率在近1年的同类收益率中的分位数',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d', '50d', '75d', '5m', '6m'],
         ],
    'ReturnPercentile_2y':
        ['当前收益率相对近2年收益的分位数',
         '收益率分位数 = 当前收益率在近2年的同类收益率中的分位数',
         ['1d', '2d', '3d', '5d' '10d', '15d', '25d', '50d', '75d', '5m', '6m', '1y'],
         ],
    'AverageDeviationReturn_2m':
        ['相较近2月收益均线偏离率',
         '均线偏离率 = (当前收益率均值 - 近2月收益均值) / 近2月收益均值',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d'],
         ],
    'AverageDeviationReturn_6m':
        ['相较近6月收益均线偏离率',
         '均线偏离率 = (当前收益率均值 - 近6月收益均值) / 近6月收益均值',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d', '50d', '75d'],
         ],
    'AverageDeviationReturn_1y':
        ['相较近1年收益均线偏离率',
         '均线偏离率 = (当前收益率均值 - 近1年收益均值) / 近1年收益均值',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d', '50d', '75d', '5m', '6m'],
         ],
    'AverageDeviationReturn_2y':
        ['相较近2年收益均线偏离率',
         '均线偏离率 = (当前收益率均值 - 近2年收益均值) / 近2年收益均值',
         ['1d', '2d', '3d', '5d' '10d', '15d', '25d', '50d', '75d', '5m', '6m', '1y'],
         ],

    ''' 相对历史风险指标 '''
    'VolatilityRollingRatio_2m':
        ['当前波动率相较近2个月波动率的滚动比率',
         '波动率滚动比率 = 当前波动率 / 近2个月波动率 (值 > 1 表示近期强于长期，< 1 则反之)',
         ['5d', '10d', '15d', '25d'],
         ],
    'VolatilityRollingRatio_6m':
        ['当前波动率相较近6个月波动率的滚动比率',
         '波动率滚动比率 = 当前波动率 / 近6个月波动率 (值 > 1 表示近期强于长期，< 1 则反之)',
         ['5d', '10d', '15d', '25d', '50d', '75d'],
         ],
    'VolatilityRollingRatio_1y':
        ['当前波动率相较近1年波动率的滚动比率',
         '波动率滚动比率 = 当前波动率 / 近1年波动率 (值 > 1 表示近期强于长期，< 1 则反之)',
         ['5d', '10d', '15d', '25d', '50d', '75d', '5m', '6m'],
         ],
    'VolatilityRollingRatio_2y':
        ['当前波动率相较近2年波动率的滚动比率',
         '波动率滚动比率 = 当前波动率 / 近2年波动率 (值 > 1 表示近期强于长期，< 1 则反之)',
         ['5d', '10d', '15d', '25d', '50d', '75d', '5m', '6m', '1y'],
         ],
    'VolatilityPercentile_2m':
        ['当前波动率相对近2个月波动率的分位数',
         '波动率分位数 = 当前收益率在近2个月的同类波动率中的分位数',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d'],
         ],
    'VolatilityPercentile_6m':
        ['当前波动率相对近6个月波动率的分位数',
         '波动率分位数 = 当前收益率在近2个月的同类波动率中的分位数',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d', '50d', '75d'],
         ],
    'VolatilityPercentile_1y':
        ['当前波动率相对近1年收波动率分位数',
         '波动率分位数 = 当前收益率在近1年的同类收波动中的分位数',
         ['1d', '2d', '3d', '5d', '10d', '15d', '25d', '50d', '75d', '5m', '6m'],
         ],
    'VolatilityPercentile_2y':
        ['当前波动率相对近2年收波动率分位数',
         '波动率分位数 = 当前收益率在近2年的同类收波动中的分位数',
         ['1d', '2d', '3d', '5d' '10d', '15d', '25d', '50d', '75d', '5m', '6m', '1y'],
         ],
}

# 滚动计算指标
rolling_metrics = {
    'PriceSigma':
        ['过去N天收盘价的滚动标准差',  # 指标名称
         'PriceSigma = 收盘价的滚动标准差',  # 指标计算逻辑
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'CloseMA':  # 移动平均系列指标
        ['N日移动平均收盘价',
         'CloseMA = 收盘价的N日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'CloseMADiff':  # 移动平均系列指标
        ['N日移动平均收盘价与当前收盘价的差值',
         'CloseMADiff = CloseMA - Close',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollUp-2':  # Bolling 系列指标
        ['bolling 上轨',
         '布林带上轨 = N日移动平均收盘价 + 2 * N日移动标准差',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollUpDiff-2':  # Bolling 系列指标
        ['bolling 上轨与收盘价之差',
         'BollUpDiff = BollUp - Close',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollDo-2':  # Bolling 系列指标
        ['bolling 下轨',
         '布林带下轨 = N日移动平均收盘价 - 2 * N日移动标准差',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollDoDiff-2':  # Bolling 系列指标
        ['bolling 下轨与收盘价之差',
         'BollDoDiff = BollDo - Close',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollUpDo-2':  # Bolling 系列指标
        ['bolling 下轨与下轨之差',
         'BollDoDiff = BollDo - BollUp',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollUp-3':  # Bolling 系列指标
        ['bolling 上轨',
         '布林带上轨 = N日移动平均收盘价 + 3 * N日移动标准差',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollUpDiff-3':  # Bolling 系列指标
        ['bolling 上轨与收盘价之差',
         'BollUpDiff = BollUp - Close',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollDo-3':  # Bolling 系列指标
        ['bolling 下轨',
         '布林带下轨 = N日移动平均收盘价 - 3 * N日移动标准差',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollDoDiff-3':  # Bolling 系列指标
        ['bolling 下轨与收盘价之差',
         'BollDoDiff = BollDo - Close',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BollUpDo-3':  # Bolling 系列指标
        ['bolling 下轨与下轨之差',
         'BollDoDiff = BollDo - BollUp',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'L':  # KDJ 系列指标
        ['过去N天的最低价 (KDJ相关指标)',
         'L = Min(N天最低价)',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'H':  # KDJ 系列指标
        ['过去N天的最低价 (KDJ相关指标)',
         'H = Max(N天最高价)',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'RSV':  # KDJ 系列指标
        ['RSV指标 (KDJ相关指标)',
         'RSV = (当前收盘价 - 最近N天最低价) / (最近N天最高价 - 最近N天最低价) * 100',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'KDJ-K-3':  # KDJ 系列指标
        ['KDJ 指标的 K 值',
         'K = RSV 的指数移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'KDJ-D-3':  # KDJ 系列指标
        ['KDJ 指标的 D 值',
         'D = K 的指数移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'KDJ-J-3':  # KDJ 系列指标
        ['KDJ 指标的 J 值',
         'J = 3 * K - 2 * D',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'KDJ-KD-3':  # KDJ 系列指标
        ['KDJ 指标的 K 值与 D 值之差',
         'KDJ-KD = K - D',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'KDJ-KJ-3':  # KDJ 系列指标
        ['KDJ 指标的 K 值与 J 值之差',
         'KDJ-KD = K - J',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'KDJ-DJ-3':  # KDJ 系列指标
        ['KDJ 指标的 D 值与 J 值之差',
         'KDJ-KD = D - J',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'EMA':  # EMA 系列指标
        ['N日指数移动平均收盘价 (MACD相关指标)',
         'EMA = 收盘价的指数移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'EMADiff':  # EMA 系列指标
        ['N日指数移动平均收盘价与收盘价之差',
         'EMADiff = EMA - Close',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'VolMA':  # 平均成交量系列指标
        ['N日移动平均成交量',
         'VolMA = 成交量的N日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'VolMADiff':  # 平均成交量系列指标
        ['N日移动平均成交量与当前成交量之差',
         'VolMADiff = VolMA - Vol',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'RSI':  # RSI 系列指标
        ['RSI 指标 (相对强弱指数)',
         'RSI = 100 - 100/RS;  RS = N天内上涨的平均收益 / N天内下跌的平均收益',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'OBV':  # OBV 系列指标
        ['OBV 指标 (能量潮指标)',
         'OBV = 今日收盘价>昨日收盘价⇒OBV+今日成交量; 今日收盘价<昨日收盘价⇒OBV-今日成交量; 今日收盘价=昨日收盘价⇒OBV不变',
         [0],  # 滚动天数为0, 表示无需滚动
         ],
    'MAOBV':  # OBV 系列指标
        ['OBV 指标的移动平均',
         'OBV 指标的移动平均',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAOBVDiff':  # OBV 系列指标
        ['OBV 指标的移动平均与 当前 OBV 指标之差',
         'MAOBVDiff = MAOBV - OBV',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'PVT':  # PVT 系列指标
        ['PVT 指标 (量价趋势指标)',
         'PVT = 昨日PVT + 当日成交量 x (今日收盘价 - 昨日收盘价) / 昨日收盘价',
         [0],  # 滚动天数为0, 表示无需滚动
         ],
    'MAPVT':  # PVT 系列指标
        ['PVT 指标的移动平均',
         'PVT 指标的移动平均',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAPVTDiff':  # PVT 系列指标
        ['PVT 指标的移动平均与 当前 PVT 指标之差',
         'MAPVTDiff = MAPVT - PVT',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MTM':  # MTM 系列指标
        ['MTM 指标 (动量指标)',
         'MTM = 当前收盘价 - N天前收盘价',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MTMMA-3':  # MTM 系列指标
        ['MTMMA 平滑动量指标',
         'MTMMA = MTM 的 3 日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MTMMADiff-3':  # MTM 系列指标
        ['MTMMA 与 当前 MTM 的差值',
         'MTMMADiff = MTMMA - MTM',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MTMMA-6':  # MTM 系列指标
        ['MTMMA 平滑动量指标',
         'MTMMA = MTM 的 6 日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MTMMADiff-6':  # MTM 系列指标
        ['MTMMA 与 当前 MTM 的差值',
         'MTMMADiff = MTMMA - MTM',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MTMMA-10':  # MTM 系列指标
        ['MTMMA 平滑动量指标',
         'MTMMA = MTM 的 10 日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MTMMADiff-10':  # MTM 系列指标
        ['MTMMA 与 当前 MTM 的差值',
         'MTMMADiff = MTMMA - MTM',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'TRIX':  # TRIX 系列指标
        ['TRIX 指标 (三重指数平滑移动平均)',
         'TRIX = EMA(EMA(EMA(收盘价))) / 收盘价 - 1',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MATRIX-3':  # TRIX 系列指标
        ['MATRIX 三重指数平滑移动平均の移动平均',
         'MATRIX = TRIX 的移动平均',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MATRIXDiff-3':  # TRIX 系列指标
        ['三重指数平滑移动平均の移动平均 与 当前 TRIX 的差值',
         'MATRIXDiff = MATRIX - TRIX',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MATRIX-5':  # TRIX 系列指标
        ['MATRIX 三重指数平滑移动平均の移动平均',
         'MATRIX = TRIX 的移动平均',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MATRIXDiff-5':  # TRIX 系列指标
        ['三重指数平滑移动平均の移动平均 与 当前 TRIX 的差值',
         'MATRIXDiff = MATRIX - TRIX',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'PSY':  # PSY 系列指标
        ['PSY 指标 (心理线 Psychological Line)',
         'PSY = 过去N天上涨天数 / 过去N天交易日数',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAPSY-3':  # PSY 系列指标
        ['心理线的移动均线',
         'MAPSY = PSY的N日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAPSYDiff-3':  # PSY 系列指标
        ['心理线的移动均线 与 当前 PSY 的差值',
         'MAPSYDiff = MAPSY - PSY',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAPSY-6':  # PSY 系列指标
        ['心理线的移动均线',
         'MAPSY = PSY的N日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAPSYDiff-6':  # PSY 系列指标
        ['心理线的移动均线 与 当前 PSY 的差值',
         'MAPSYDiff = MAPSY - PSY',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'CCI':  # CCI 系列指标
        ['CCI 指标 (顺势指标)',
         'CCI简化 = (TP - MA) / (0.015 * MD)',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'CR':  # CR 系列指标
        ['CR 指标 (CurrentRatio 现价能量强度指标)',
         'CR = (当日最高价 - 昨日中间价) / (昨日中间价 - 当日最低价)',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MACR-10-5':  # CR 系列指标; 'MACR-10-5' 与 'MACR-20-9' 构成的区间叫做 '副地震带'
        ['CR指标的N移动平均往后移动M天',
         'CR指标的移动平均 = CR的10日移动平均后移5天',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MACRDiff-10-5':  # CR 系列指标; 'MACR-10-5' 与 'MACR-20-9' 构成的区间叫做 '副地震带'
        ['CR指标的N移动平均往后移动M天 与 当前CR指标之差',
         'MACRDiff = MACR - CR',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MACR-20-9':  # CR 系列指标; 'MACR-10-5' 与 'MACR-20-9' 构成的区间叫做 '副地震带'
        ['CR指标的N移动平均往后移动M天',
         'CR指标的移动平均 = CR的20日移动平均后移9天',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MACRDiff-20-9':  # CR 系列指标; 'MACR-10-5' 与 'MACR-20-9' 构成的区间叫做 '副地震带'
        ['CR指标的N移动平均往后移动M天 与 当前CR指标之差',
         'MACRDiff = MACR - CR',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MACR-40-17':  # CR 系列指标; 'MACR-40-17' 与 'MACR-62-28' 构成的区间叫做 '主地震带'
        ['CR指标的N移动平均往后移动M天',
         'CR指标的移动平均 = CR的40日移动平均后移17天',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MACRDiff-40-17':  # CR 系列指标; 'MACR-40-17' 与 'MACR-62-28' 构成的区间叫做 '主地震带'
        ['CR指标的N移动平均往后移动M天 与 当前CR指标之差',
         'MACRDiff = MACR - CR',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MACR-62-28':  # CR 系列指标; 'MACR-40-17' 与 'MACR-62-28' 构成的区间叫做 '主地震带'
        ['CR指标的N移动平均往后移动M天',
         'CR指标的移动平均 = CR的62日移动平均后移28天',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MACRDiff-62-28':  # CR 系列指标; 'MACR-40-17' 与 'MACR-62-28' 构成的区间叫做 '主地震带'
        ['CR指标的N移动平均往后移动M天 与 当前CR指标之差',
         'MACRDiff = MACR - CR',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'VR':  # VR 系列指标
        ['VR 指标 (成交量变异率)',
         'VR = N日内上升日成交额总和 / N日内下降日成交额总和',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAVR-3':  # VR 系列指标
        ['VR 指标的移动平均',
         'VR = VR 的 3 日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAVRDiff-3':  # VR 系列指标
        ['VR的移动平均 与 当前VR指标之差',
         'MAVRDiff = MAVR - VR',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAVR-6':  # VR 系列指标
        ['VR 指标的移动平均',
         'MAVR = VR 的 6 日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAVRDiff-6':  # VR 系列指标
        ['VR的移动平均 与 当前VR指标之差',
         'MAVRDiff = MAVR - VR',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAVR-12':  # VR 系列指标
        ['VR 指标的移动平均',
         'MAVR = VR 的 12 日移动平均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MAVRDiff-12':  # VR 系列指标
        ['VR的移动平均 与 当前VR指标之差',
         'MAVRDiff = MAVR - VR',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'AR':  # BRAR 系列指标
        ['AR（人气指标）',
         '和BR并称为BARA, AR = (H - O) / (O - L)',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BR':  # BRAR 系列指标
        ['BR（买气指标）',
         '和AR并称为BARA, BR = (H - C) / (C - L)',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BRARDiff':  # BRAR 系列指标
        ['BR 与 AR 之差',
         'BRARDiff = BR - AR',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'ARDiff-40':  # BRAR 系列指标
        ['AR 与 40 之差',
         'AR-40 = AR - 40',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'ARDiff-180':  # BRAR 系列指标
        ['AR 与 180 之差',
         'AR-40 = AR - 180',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BRDiff-400':  # BRAR 系列指标
        ['BR 与 400 之差',
         'BR-400 = BR - 400',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BRDiff-40':  # BRAR 系列指标
        ['BR 与 40 之差',
         'BR-40 = BR - 40',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'BIAS':  # BIAS 系列指标
        ['乖离率',
         'BIAS = (当前收盘价 - N日均线) / N日均线 * 100%',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MABIAS-5':  # BIAS 系列指标
        ['乖离率的移动均值',
         'MABIAS-5 = BIAS的5日移动均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MABIASDiff-5':  # BIAS 系列指标
        ['乖离率移动均值 与 当前 BIAS 之差',
         'MABIASDiff = MABIAS - BIAS',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MABIAS-10':  # BIAS 系列指标
        ['乖离率的移动均值',
         'MABIAS-5 = BIAS的5日移动均值',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MABIASDiff-10':  # BIAS 系列指标
        ['乖离率移动均值 与 当前 BIAS 之差',
         'MABIASDiff = MABIAS - BIAS',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'TR':  # DMI 系列指标
        ['真实波动范围',
         'TR = Max(当前高价 - 当前低价, 当前高价 - 昨日收盘价, 当前低价 - 昨日收盘价)',
         [0],  # 滚动天数
         ],
    'PDI':  # DMI 系列指标
        ['正向动向',
         'PDI = 平滑(+DM) / 平滑(TR) * 100%',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MDI':  # DMI 系列指标
        ['反向动向',
         'MDI = 平滑(-DM) / 平滑(TR) * 100%',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'PDIMDIDiff':  # DMI 系列指标
        ['PDI 与 MDI 之差',
         'PDIMDIDiff = PDI - MDI',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'ADX-6':  # DMI 系列指标
        ['平均趋向指数',
         'ADX = 平滑 [(PDI - MDI) / (PDI + MDI)] * 100%',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'ADXR-6-6':  # DMI 系列指标
        ['平均趋向指数平滑值',
         'ADXR-6-6 = (ADX-6 + 6天前的ADX-6) / 2',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'ADXRDiff-6-6':  # DMI 系列指标
        ['ADX的平滑值 与 ADX 之差',
         'ADXRDiff = ADXR - ADX',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'ADXR-6-14':  # DMI 系列指标
        ['平均趋向指数平滑值',
         'ADXR-6-14 = (ADX-6 + 14天前的ADX-6) / 2',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'ADXRDiff-6-14':  # DMI 系列指标
        ['ADX的平滑值 与 ADX 之差',
         'ADXRDiff = ADXR - ADX',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'DKX':  # DKX 系列指标
        ['DKX 指标 (多空指标)',
         'DKX = B的滑动加权平均; B=(3⋅C + H + L + O) / 6',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'DKXDiff':  # DKX 系列指标
        ['DKX 与 当前收盘价的差值',
         'DKXDiff = DKX - Close',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MADKX-5':  # DKX 系列指标
        ['DKX 指标的移动平均',
         'DKX指标的 6日 移动平均',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MADKXDiff-5':  # DKX 系列指标
        ['DKX的移动平均 与 DKX 的差值',
         'MADKXDiff = MADKX - DKX',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MADKX-10':  # DKX 系列指标
        ['DKX 指标的移动平均',
         'DKX指标的 6日 移动平均',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MADKXDiff-10':  # DKX 系列指标
        ['DKX的移动平均 与 DKX 的差值',
         'MADKXDiff = MADKX - DKX',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MADKX-15':  # DKX 系列指标
        ['DKX 指标的移动平均',
         'DKX指标的 6日 移动平均',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
    'MADKXDiff-15':  # DKX 系列指标
        ['DKX的移动平均 与 DKX 的差值',
         'MADKXDiff = MADKX - DKX',
         [3, 4, 5, 6, 7, 8, 9, 10, 12, 14, 15, 19, 20, 22, 25, 26, 30, 35, 60, 99],  # 滚动天数
         ],
}

# 长短期衍生指标
long_short_metrics = {
    'BBI':
        ['BBI 指标 (多空指标)',
         'BBI = (MA3 + MA6 + MA12 + MA24) / 4',
         [],  # 滚动天数
         ],
    'DMA':
        ['DMA 指标 (平均线差)',
         'DMA = (MA短期 - MA长期) 的移动平均',
         [],  # 滚动天数
         ],
    'DIF':  # 不属于滚动指标, 属于EMA的衍生指标 (滚动衍生指标)
        ['MACD 指标的 DIF 值 (快线-趋势变化)',
         'DIF = EMA(短期) - EMA(长期)',
         [],  # 滚动天数
         ],
    'DEA':  # 不属于滚动指标, 属于EMA的衍生指标 (滚动衍生指标)
        ['MACD 指标的 DEA 值 (慢线-趋势平滑)',
         'DEA = DIF 的指数移动平均值',
         [],  # 滚动天数
         ],
    'MACD':  # 不属于滚动指标, 属于EMA的衍生指标 (滚动衍生指标)
        ['MACD 值 (快线-慢线)',
         'MACD = 2 (DIF - DEA)',
         [],  # 滚动天数
         ],
    'ADXSlop-6':  # MDI 系列指标
        ['ADX 的斜率',
         'ADX 的斜率',
         [],
         ]
}


# 创建一个按周期分组的指标映射表
def create_period_metrics_map():
    """
    创建一个按周期分组的指标映射表。

    该函数遍历 `log_return_metrics_dict` 中的每个指标，根据指标的周期将其分组，
    最终返回一个字典，其中键为周期，值为该周期下的所有指标键列表。

    返回值:
        dict: 一个字典，键为周期，值为该周期下的所有指标键列表。
    """
    # 初始化一个字典，默认值为列表
    period_metrics_map = defaultdict(list)

    # 遍历 log_return_metrics_dict 中的每个指标
    for metric_key, (name, formula, periods) in log_return_metrics_dict.items():
        # 遍历该指标的所有周期，并将指标键添加到对应周期的列表中
        for period in periods:
            period_metrics_map[period].append(metric_key)

    # 转换为普通字典并返回
    return dict(period_metrics_map)


# 创建一个按滚动天数分组的指标映射表
def create_rolling_metrics_map():
    # 初始化一个字典，默认值为列表
    period_metrics_map = defaultdict(list)
    for metric_key, (name, formula, roll_days) in rolling_metrics.items():
        # 遍历该指标的所有周期，并将指标键添加到对应周期的列表中
        for roll_day in roll_days:
            period_metrics_map[roll_day].append(metric_key)

    return period_metrics_map


if __name__ == '__main__':
    res = create_rolling_metrics_map()
    print(res)
    r_l = list(res.keys())
    print(r_l)
