# -*- encoding: utf-8 -*-
"""
@File: Y02_asset_id_map.py.py
@Modify Time: 2025/9/20 21:02       
@Author: Kevin-Chen
@Descriptions: 
"""

# iis_mdl_aset_pct_d 的 aset_bclass_cd 字段与 iis_aset_allc_indx_wght 表的什么字段对应
asset_to_weight_column_map = {
    '货币': 'csh_mgt_typ_pos',  # 现金管理类持仓
    '固收': 'fx_yld_pos',  # 固定持仓
    '混合': 'mix_strg_typ_pos',  # 混合持仓
    '权益': 'eqty_invst_pos',  # 权益混合持仓
    '另类': 'altrnt_invst_pos',  # 另类投资持仓
}
# 基准组合权重配置
C1 = {'货币': 1.00, '固收': 0.00, '混合': 0.00, '权益': 0.00, '另类': 0.00}
C2 = {'货币': 0.20, '固收': 0.80, '混合': 0.00, '权益': 0.00, '另类': 0.00}
C3 = {'货币': 0.10, '固收': 0.55, '混合': 0.35, '权益': 0.00, '另类': 0.00}
C4 = {'货币': 0.05, '固收': 0.40, '混合': 0.30, '权益': 0.20, '另类': 0.05}
C5 = {'货币': 0.05, '固收': 0.20, '混合': 0.25, '权益': 0.40, '另类': 0.10}
C6 = {'货币': 0.05, '固收': 0.10, '混合': 0.15, '权益': 0.60, '另类': 0.10}
